---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalLoadClassificationData
source: html/ebc257be-723e-afa2-ec03-c8aa3835858c.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadClassificationData

This enum is used by the ElectricalLoadClassification class as additional data whenever
 data members changed. It is used as the additional data when the atom corresponding to each
 data member is touched.

## Syntax (C#)
```csharp
public enum ElectricalLoadClassificationData
```